src/cf/src/Documents/ПоступлениеТоваровУслуг/ПоступлениеТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваровУслуг</name>
  <basedOn>Document.ЗаказПоставщику</basedOn>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <registerRecords>AccumulationRegister.Убытки</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатуры</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ЦеныНоменклатурыПоставщиков</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ПотребностиПроизводства</registerRecords>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПоставщику</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦеныПоТипуЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузочногоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтгрузочногоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураКонтрагента</name>
      <type>
        <types>CatalogRef.НоменклатураКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>УказаноНесколькоСерий</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковокПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПринято</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаМинимальная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаРозничная</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаПоТипуЦен</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСерии</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧУслуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧДополнительныеРасходы</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыСКонтрагентами</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатьяДДС</name>
      <type>
        <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧЗачётАвансов</name>
    <attributes>
      <name>Основание</name>
      <type>
        <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
        <types>DocumentRef.КорректировкаДолга</types>
        <types>DocumentRef.РасходныйКассовыйОрдер</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </resources>
  <dimensions>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Enums/СтатусыДокументов/СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументов</name>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ПоступлениеТоваровУслуг/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Перем ЗакрытиеФормы;

#Область Обработчики_событий_формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	РаботаСДокументами.МожноРедактироватьДокументВФорме(Объект.Ссылка, ЭтаФорма);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);  
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, Объект);
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ТипЦеныПоТипуЦен = Константы.ВыводитьВЗакупкеТипЦен.Получить();
		Объект.Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
		Объект.КурсВалюты = 1;
	Иначе
		Если Объект.Статус = Перечисления.СтатусыДокументов.Завершен 
			и (не РегистрыСведений.НастройкиПользователей.РедактироватьЗавершенныеДокументы() И не РольДоступна("Администратор")) Тогда
			ЭтотОбъект.ТолькоПросмотр = Истина;
		КонецЕсли;
	КонецЕсли;
	ЗаполнитьСрокОплатыНаСервере();
	СрокОплаты = РаботаСДокументами.ПолучитьСрокОплаты(Объект.Контрагент,Объект.Дата);
	ЗаполнитьОстаткиНаСервере();
	НастройкаФормы();
	КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подменю", Элементы.ТЧТовары.КоманднаяПанель);
	Если Не ТолькоПросмотр Тогда
		КомандыТабличныхЧастейВызовСервера.ПодключитьКоманду(ЭтотОбъект, "Подбор", Элементы.ТЧТовары.КоманднаяПанель);
	КонецЕсли;
	РаботаСДокументами.ОграничитьВидимостьРеквизитовПоТипу(ЭтотОбъект, "ОператорПроизводства");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОперацииСПодключаемымОборудованиемКлиент.ПодключитьОборудование(УникальныйИдентификатор, Истина); 
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	КолонкаКоличество = "КоличествоУпаковок";
	Отказ = Не СерииИРазмещениеКлиент.ПроверитьСоответствиеСерийТоварам(ЭтаФорма, Объект.ТЧТовары, Объект.ТЧСерии, ПараметрыЗаписи, КолонкаКоличество);
	РаботаСДокументамиКлиент.ПроверитьСуммуАвансовТоварногоДокумента(Объект, Отказ);
	Если Не Отказ и ЗакрытиеФормы = Неопределено Тогда
		СообщениеОбОтклонении = ПроверитьОтклонениеЦен();
		Если ЗначениеЗаполнено(СообщениеОбОтклонении) Тогда
			Отказ = Истина;
			Оп = Новый ОписаниеОповещения("ПослеЗакрытияВопросаОбОтклоненииЦен", ЭтаФорма, ПараметрыЗаписи);
			РаботаСДокументамиКлиент.ПоказатьВопросОПроверкеДокумента(Оп, СообщениеОбОтклонении);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить(РаботаСДокументами.СвойствоЗаписьИзФормы(), Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	РаботаСДокументами.УстановитьЗаголовокФормыДокумента(ЭтаФорма, ТекущийОбъект);
	ЗаполнитьСрокОплатыНаСервере();
	ЗаполнитьОстаткиНаСервере();
	НастройкаФормы();
КонецПроцедуры

#КонецОбласти 

#Область Обработчики_элементов_формы  

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
	КонтрагентПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	Объект.Договор = ОбщегоНазначенияВызовСервера.ПолучитьОсновнойДоговор(Объект.Контрагент, Объект.Организация, Ложь);
	ЗаполнитьСрокОплатыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура МестоХраненияПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыФункциональныхОпций(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЦенаВключаетНДСПриИзменении(Элемент)
	Для Каждого Стр Из Объект.ТЧТовары Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);	
	КонецЦикла;
	Для Каждого Стр Из Объект.ТЧУслуги Цикл
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Стр, Объект.ЦенаВключаетНДС);	
	КонецЦикла;
	//ТипЦеныПоТипуЦенПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УказатьСерии(Команда)
	КолонкаКоличество = "КоличествоУпаковок";
	СерииИРазмещениеКлиент.УказатьСерии(Элементы.ТЧТовары.ТекущиеДанные, Объект, , КолонкаКоличество);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыПоСуммеДокумента(Команда)
	ЗаполнитьПоОстаткамНаСервере(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьАвансыВсеНезакрытые(Команда)
	ЗаполнитьПоОстаткамНаСервере(Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧЗачётАвансовОснованиеПриИзменении(Элемент)
	ТекСтр = Элементы.ТЧЗачётАвансов.ТекущиеДанные;
	ДанныеСуммы = РаботаСДокументамиВызовСервера.ПолучитьСуммуОснованияДляПлатёжногоДокумента(ТекСтр.Основание);
	ЗаполнитьЗначенияСвойств(ТекСтр, ДанныеСуммы);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	Если НоваяСтрока Тогда
		ТекСтр = Элемент.ТекущиеДанные;
		ТекСтр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(Объект.ТЧТовары);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередОкончаниемРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, Отказ)
	РаботаСДокументамиКлиент.ПроверитьКратностьЕдиницы(Элемент.ТекущиеДанные, Объект, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыПередУдалением(Элемент, Отказ)
	Для Каждого Инд Из Элементы.ТЧТовары.ВыделенныеСтроки Цикл
		Стр = Объект.ТЧТовары.НайтиПоИдентификатору(Инд);
		РаботаСДокументамиКлиентСервер.УдалитьСвязанныеСтроки(Объект, "ТЧСерии", Стр.КодСтроки);
	КонецЦикла;
КонецПроцедуры  

&НаКлиенте
Процедура ТЧТоварыНоменклатураКонтрагентаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатурыКонтрагента(Элементы.ТЧТовары.ТекущиеДанные, Объект);
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект, Ложь);
КонецПроцедуры 

&НаКлиенте
Процедура ТЧТоварыНоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ПараметрыАвтоподбора = РаботаСДокументамиКлиент.ПараметрыАвтободбораНоменклатуры();
	ПараметрыАвтоподбора.ИсключитьХарактеристикиДляВнутреннегоИспользования = Истина;
	РаботаСДокументамиКлиент.АвтоподборНоменклатуры(ДанныеВыбора, ПараметрыПолученияДанных, Объект, СтандартнаяОбработка, ПараметрыАвтоподбора);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыНоменклатураОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РаботаСДокументамиКлиент.ОбрабокаВыбораПриАвтоподбореНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, ВыбранноеЗначение, Объект, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыХарактеристикаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыУпаковкаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(Элементы.ТЧТовары.ТекущиеДанные, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыКоличествоУпаковокПринятоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьКоличество(Элементы.ТЧТовары.ТекущиеДанные, "Принято");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧТоварыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиКоличествоПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиЦенаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Цена");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС, "Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧУслуги.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧУслугиСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧТовары.ТекущиеДанные, Объект.ЦенаВключаетНДС, "СуммаНДС");
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСтавкаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСуммаНДСПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ТЧДополнительныеРасходыСуммаПриИзменении(Элемент)
	РаботаСДокументамиКлиентСервер.РассчитатьСтроку(Элементы.ТЧДополнительныеРасходы.ТекущиеДанные, Объект.ЦенаВключаетНДС);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзExcel(Команда)
	Оп = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузки",ЭтаФорма);
	Пар = Новый Структура("СоздаватьТовары",Истина);
	ОткрытьФорму("Обработка.ЗагрузкаИзExcel.Форма.Форма",Пар,ЭтотОбъект,ЭтотОбъект.УникальныйИдентификатор,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаКлиенте
Процедура ТипЦеныПоТипуЦенПриИзменении(Элемент)
	ТипЦеныПоТипуЦенПриИзмененииНаСервере();
	НастройкаФормы();
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ЗаполнитьСрокОплатыНаСервере();
КонецПроцедуры

#КонецОбласти 

#Область Оповещения

&НаКлиенте
Процедура ПослеЗакрытияВопросаОбОтклоненииЦен(РезультатЗакрытия, ПараметрыЗаписи) Экспорт
	Если РезультатЗакрытия = Неопределено Или РезультатЗакрытия = КодВозвратаДиалога.Отмена Тогда Возврат КонецЕсли;
	ЗакрытиеФормы = Истина;
	ЭтаФорма.Записать(ПараметрыЗаписи);
	ЭтаФорма.Закрыть();
КонецПроцедуры	

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ScanData" и ВводДоступен() Тогда 
		Штрихкод = ОперацииСПодключаемымОборудованиемКлиент.ПолучитьШтрихкод(ИмяСобытия, Параметр, Источник);
		СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(Штрихкод);
		Если СтруктураТОвара = Неопределено Тогда
			Оп = Новый ОписаниеОповещения("ПослеДобавленияНоменклатуры",ЭтаФорма,Новый Структура("Штрихкод",Штрихкод));
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента",Новый Структура("Штрихкод",Штрихкод),ЭтаФорма,,,,Оп,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		Иначе
			РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузки(Результат,ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда Возврат; КонецЕсли;
	ЗаполнитьИзExcelНаСервере(Результат);
	ЗаполнитьОстаткиНаСервере();
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Дополнительно

&НаСервере
Функция ПроверитьОтклонениеЦен()
	УстановитьПривилегированныйРежим(Истина);
	Результат = "";
	//ПроцентОтклонения = Константы.ДопустимоеОтклонениеЦенПриПоступлении.Получить();
	//Если ПроцентОтклонения <> 0 Тогда
	//	Запрос = Новый Запрос("ВЫБРАТЬ
	//	                      |	ВЫРАЗИТЬ(ТЗ.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	//	                      |	ВЫРАЗИТЬ(ТЗ.Характеристика КАК Справочник.ХарактеристикиНоменклатуры) КАК Характеристика,
	//	                      |	ВЫРАЗИТЬ(ТЗ.Цена КАК ЧИСЛО) КАК Цена
	//	                      |ПОМЕСТИТЬ ВТ
	//	                      |ИЗ
	//	                      |	&ТЗ КАК ТЗ
	//	                      |;
	//	                      |
	//	                      |////////////////////////////////////////////////////////////////////////////////
	//	                      |ВЫБРАТЬ
	//	                      |	ВЗ.Номенклатура КАК Номенклатура,
	//	                      |	ВЗ.Характеристика КАК Характеристика,
	//	                      |	ВЗ.Цена КАК Цена,
	//	                      |	ВЗ.ДопустимоеОтклонение КАК ДопустимоеОтклонение,
	//	                      |	ВЗ.ПоследняяЦена КАК ПоследняяЦена,
	//	                      |	ВЗ.Отклонение КАК Отклонение
	//	                      |ИЗ
	//	                      |	(ВЫБРАТЬ
	//	                      |		ВЗ.Номенклатура КАК Номенклатура,
	//	                      |		ВЗ.Характеристика КАК Характеристика,
	//	                      |		ВЗ.Цена КАК Цена,
	//	                      |		ВЗ.ДопустимоеОтклонение КАК ДопустимоеОтклонение,
	//	                      |		ВЗ.ПоследняяЦена КАК ПоследняяЦена,
	//	                      |		ВЫБОР
	//	                      |			КОГДА ВЗ.ПоследняяЦена = 0
	//	                      |				ТОГДА 0
	//	                      |			ИНАЧЕ ОКР(ВЗ.Цена / ВЗ.ПоследняяЦена * 100 - 100, 2)
	//	                      |		КОНЕЦ КАК Отклонение
	//	                      |	ИЗ
	//	                      |		(ВЫБРАТЬ
	//	                      |			ВТ.Номенклатура КАК Номенклатура,
	//	                      |			ВТ.Характеристика КАК Характеристика,
	//	                      |			ВТ.Цена КАК Цена,
	//	                      |			ДопустимоеОтклонениеЦенПриПоступлении.Значение КАК ДопустимоеОтклонение,
	//	                      |			МАКСИМУМ(ЕСТЬNULL(ПоследниеЦены.ЦенаЕдиницыХранения, 0)) КАК ПоследняяЦена
	//	                      |		ИЗ
	//	                      |			ВТ КАК ВТ
	//	                      |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатурыПоставщиков.СрезПоследних(&ДатаСреза, ) КАК ПоследниеЦены
	//	                      |				ПО ВТ.Номенклатура = ПоследниеЦены.Номенклатура
	//	                      |					И ВТ.Характеристика = ПоследниеЦены.Характеристика,
	//	                      |			Константа.ДопустимоеОтклонениеЦенПриПоступлении КАК ДопустимоеОтклонениеЦенПриПоступлении
	//	                      |		
	//	                      |		СГРУППИРОВАТЬ ПО
	//	                      |			ВТ.Номенклатура,
	//	                      |			ВТ.Характеристика,
	//	                      |			ВТ.Цена,
	//	                      |			ДопустимоеОтклонениеЦенПриПоступлении.Значение) КАК ВЗ) КАК ВЗ
	//	                      |ГДЕ
	//	                      |	НЕ(ВЗ.Отклонение МЕЖДУ -ВЗ.ДопустимоеОтклонение И ВЗ.ДопустимоеОтклонение)");
	//	Запрос.УстановитьПараметр("ДатаСреза", РаботаСДокументами.ПолучитьГраницуДокумента(Объект));
	//	Запрос.УстановитьПараметр("ТЗ", Объект.ТЧТовары.Выгрузить(, "Номенклатура, Характеристика, Цена"));		
	//	ТЗЦены = Запрос.Выполнить().Выгрузить();
	//	Для Каждого Стр Из ТЗЦены Цикл
	//		ТекстОшибки = ОбщегоНазначенияКлиентСервер.ПредставлениеНоменклатуры(Стр.Номенклатура, Стр.Характеристика) + 
	//			" - цена отличается от предыдущей на " + ВычисленияКлиентСервер.МодульЧисла(Стр.Отклонение) + "%";
	//		ОбщегоНазначенияКлиентСервер.ДобавитьКСтроке(Результат, ТекстОшибки, Символы.ПС);  
	//	КонецЦикла;
	//КонецЕсли;
	Возврат Результат;
КонецФункции	
	
&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере(ВсеНеоплаченные)
	РаботаСДокументами.ПолучитьАвансыДляЗакрытия(Объект, Ложь, ВсеНеоплаченные);		
КонецПроцедуры

&НаКлиенте
Процедура ПослеДобавленияНоменклатуры(Результат,ДопПараметры) Экспорт
	СтруктураТОвара = ОбщегоНазначенияВызовСервера.ПолучитьНоменклатуруПоШтрихкоду(ДопПараметры.Штрихкод);
	РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоШтрихкоду(ДопПараметры.Штрихкод, Объект, СтруктураТОвара,,,ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	П = Новый Структура("Док",Объект.Ссылка);
	ОткрытьФорму("Обработка.ПечатьЭтикеток.Форма.Форма",П,ЭтаФорма,ЭтаФорма);
КонецПроцедуры

&НаСервере
Процедура НастройкаФормы()
	Элементы.ТЧТоварыПечатьЭтикеток.Доступность = Не Объект.Ссылка.Пустая();
	Элементы.ТЧТоварыЗаполнитьИзExcel.Доступность = Не ТолькоПросмотр;
	Элементы.ТЧТоварыЦенаПоТипуЦен.Видимость = ЗначениеЗаполнено(Объект.ТипЦеныПоТипуЦен);
	Элементы.ТЧТоварыЦенаПоТипуЦен.Заголовок = СокрЛП(Объект.ТипЦеныПоТипуЦен) + " TTC";
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзExcelНаСервере(Мас)
	Объект.ТЧТовары.Очистить();
	Для Каждого Эл из Мас Цикл
		НС = Объект.ТЧТовары.Добавить();
		ЗаполнитьЗначенияСвойств(НС,Эл,,"ЦенаМинимальная,ЦенаРозничная");
		РаботаСДокументамиКлиентСервер.УстановитьПараметрыНоменклатуры(НС, Объект, Ложь);
		НС.Количество = Эл.Количество;
		НС.КоличествоУпаковок = Эл.КоличествоУпаковок;
		Если ЗначениеЗаполнено(Эл.Цена) Тогда 
			НС.Цена = Эл.Цена;
		КонецЕсли;
		НС.СтавкаНДС = НС.Номенклатура.СтавкаНДС;
		Если ЗначениеЗаполнено(НС.Номенклатура) Тогда 
			НС.Упаковка = НС.Номенклатура.Единица;
		КонецЕсли;
		Если ЗначениеЗаполнено(Эл.ЦенаМинимальная) Тогда 
			НС.ЦенаМинимальная = Эл.ЦенаМинимальная;
		КонецЕсли;
		Если ЗначениеЗаполнено(Эл.ЦенаРозничная) Тогда 
			НС.ЦенаРозничная = Эл.ЦенаРозничная;
		КонецЕсли;
		РаботаСДокументамиКлиентСервер.РассчитатьСтроку(НС, Объект.ЦенаВключаетНДС);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ТипЦеныПоТипуЦенПриИзмененииНаСервере()
	Номенклатура = Объект.ТЧТовары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
	Если ЗначениеЗаполнено(Объект.ТипЦеныПоТипуЦен) Тогда 
		ТЗЦеныПоТипуЦен = РегистрыСведений.ЦеныНоменклатуры.ПоследнийПрайс(ТекущаяДатаСеанса(),Объект.ТипЦеныПоТипуЦен,Номенклатура);
		Для Каждого Стр из Объект.ТЧТовары Цикл
			СтрЦена = ТЗЦеныПоТипуЦен.Найти(Стр.Номенклатура);
			Стр.ЦенаПоТипуЦен = ?(СтрЦена = Неопределено, 0, СтрЦена.Цена);
			//Если Не Объект.ЦенаВключаетНДС Тогда 
			//	Стр.ЦенаПоТипуЦен = Стр.ЦенаПоТипуЦен - РаботаСДокументамиКлиентСервер.РассчитатьСуммуНДС(Стр.СтавкаНДС,Стр.ЦенаПоТипуЦен, Истина);
			//КонецЕсли;
		КонецЦикла;
	Иначе
		Для Каждого Стр из Объект.ТЧТовары Цикл
			Стр.ЦенаПоТипуЦен = 0;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьСрокОплатыНаСервере()
	СрокОплаты = РаботаСДокументами.ПолучитьСрокОплаты(Объект.Контрагент,?(Объект.Ссылка.Пустая(),ТекущаяДата(),Объект.Дата));
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОстаткиНаСервере()
	МасПоиска = Новый Массив;
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.Характеристика КАК Характеристика
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТоварыВНаличииОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыВНаличииОстатки.Характеристика КАК Характеристика,
	|	ТоварыВНаличииОстатки.Серия КАК Серия,
	|	ТоварыВНаличииОстатки.КоличествоОстаток КАК Остаток
	|ИЗ
	|	РегистрНакопления.ТоварыВНаличии.Остатки(
	|			,
	|			МестоХранения = &МестоХранения
	|				И (Номенклатура, Характеристика) В
	|					(ВЫБРАТЬ
	|						ВТ.Номенклатура,
	|						ВТ.Характеристика
	|					ИЗ
	|						ВТ КАК ВТ)) КАК ТоварыВНаличииОстатки";
	Запрос.УстановитьПараметр("ВТ",Объект.ТЧТовары.Выгрузить());
	Запрос.УстановитьПараметр("МестоХранения",РегистрыСведений.НастройкиПользователей.СкладПользователя());
	ТЗОстатки = Запрос.Выполнить().Выгрузить();
	Для Каждого Стр из Объект.ТЧТовары Цикл 
		МасОстаток = ТЗОстатки.НайтиСтроки(Новый Структура("Номенклатура,Характеристика",Стр.Номенклатура,Стр.Характеристика));
		Если МасОстаток.Количество() = 0 Тогда Продолжить; КонецЕсли;
		СтрОстаток = МасОстаток.Получить(0);
		Стр.Остаток = СтрОстаток.Остаток;
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьОбщуюКоманду(Команда)
	КомандыТабличныхЧастейКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда.Имя);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") И ВыбранноеЗначение.Свойство("Количество") Тогда
		РаботаСДокументамиКлиентСервер.ДобавитьНоменклатуруПоПодбору(Объект, ВыбранноеЗначение, , Неопределено, ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
